tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "lokalise/cli-2"
brew "ruby"
brew "cocoapods"
brew "git-lfs"
brew "mas"
brew "mint"
brew "node"
brew "pyenv"
brew "pytorch"
brew "rustup-init"
brew "starship"
brew "stow"
brew "swiftformat"
brew "swiftlint"
brew "tree"
brew "lokalise/cli-2/lokalise2"
cask "adobe-creative-cloud"
cask "android-file-transfer"
cask "blender"
cask "brave-browser"
cask "cleanmymac"
cask "deepl"
cask "dropbox"
cask "figma"
cask "firefox"
cask "flutter"
cask "gltfquicklook"
cask "google-chrome"
cask "insomnia"
cask "karabiner-elements"
cask "ledger-live"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "min"
cask "notion"
cask "pop"
cask "raycast"
cask "signal"
cask "slack"
cask "spotify"
cask "todoist"
cask "visual-studio-code"
cask "warp"
cask "xcodes"
cask "zoom"
mas "Be Focused Pro", id: 961632517
mas "Bitwarden", id: 1352778147
mas "CapCut", id: 1500855883
mas "Captionator", id: 1627843786
mas "DaisyDisk", id: 411643860
mas "DigiDoc4 Client", id: 1370791134
mas "Disk Speed Test", id: 425264550
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Surfshark", id: 1437809329
mas "Web eID", id: 1576665083
mas "Xcode", id: 497799835
