tap "dral3x/dral3x"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lokalise/cli-2"
brew "node"
brew "bitwarden-cli"
brew "ruby"
brew "cocoapods"
brew "gnutls"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "grpc"
brew "jupyterlab", link: false
brew "mas"
brew "mint"
brew "openblas"
brew "numpy"
brew "openssl@1.1"
brew "python@3.11"
brew "pyenv"
brew "pytorch", link: false
brew "rustup-init"
brew "starship"
brew "stow"
brew "swiftformat"
brew "swiftlint"
brew "tree"
brew "lokalise/cli-2/lokalise2"
cask "adobe-creative-cloud"
cask "android-file-transfer"
cask "arc"
cask "blender"
cask "brave-browser"
cask "cleanmymac"
cask "deepl"
cask "diffmerge"
cask "figma"
cask "firefox"
cask "flutter"
cask "gltfquicklook"
cask "google-chrome"
cask "insomnia"
cask "karabiner-elements"
cask "ledger-live"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "notion-calendar"
cask "obsidian"
cask "pop"
cask "raycast"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "todoist"
cask "visual-studio-code"
cask "warp"
cask "xcodes"
cask "zoom"
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "DigiDoc4 Client", id: 1370791134
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "SonicWall Mobile Connect", id: 822514576
mas "Surfshark", id: 1437809329
mas "The Unarchiver", id: 425424353
mas "Web eID", id: 1576665083
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
