tap "dral3x/dral3x"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lokalise/cli-2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Next generation open source RPC library and framework
brew "grpc"
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tensors and dynamic neural networks
brew "pytorch", link: false
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Lokalise CLI v2
brew "lokalise/cli-2/lokalise2"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Chromium based browser
cask "arc"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Trains AIs to understand and translate texts
cask "deepl"
# Visually compare and merge files
cask "diffmerge"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Quick Look plugin for glTF files
cask "gltfquicklook"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Keyboard customiser
cask "karabiner-elements"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Remote pair programming
cask "pop"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Video communication and virtual meeting platform
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
